---
layout: post
title: "早期诗歌拾录--秋夜随笔及其他"
permalink: /blog/poems/
author: "高析"
categories: 诗歌
---


## 秋夜随笔

蝉鸣江愈冷  夜静草微风
孤灯长向里  石桥二三声
晚星染秋痕  旅人待良辰
梦中无所忆  唯有雨倾城
          --高析
          甲午年九月

##
         
程序员的爱情

一

自从遇见你的那天起
每一天便从枚举值
变成了布尔值
--有你的日子和没你的日子

二

从那天开始
我的梦想和希望
由整形变成了浮点数
想多长 就有多长
只是一直忘了告诉你
你是指数 我是小小的底数
没有你 我仅仅是个卑微的小数字

三

过去无论你是否愿意低头看看
你始终未知
我的守护进程一直在为你等待
曾经多少次
想跳出自己的单线程
却发现 爱上你
无法中断

Version 2.0 修改了平仄及韵脚的BUG. 
.
陇上春至
.
暖风沐雨迎新绿
草中黄鸟复唧唧
游人自起游园意
布衣但愁农忙时
.
高析 
乙未年正月初二

短歌行  - 高析

东南有海 大而为洋
敖广动之 风起鸥殇
若其静之 印宇之光
海不自多 饮河茫茫
水何澹澹 西北始往
生于苍茫 泠于朔方 
我自凛冽 沐雨风霜
祁连无尽 天山雪藏
西北风狂 东海水汤
路崎且岖 何惧漫长
不忘前路 不吝旧伤
路遥山毅 但为君往

--二零一四年十一月

